[
    {
      "Sno": "Section I of XI",
      "Content": "We are accustomed to reading books that present information, ideas and arguments systematically and coherently. So when we embark on the study of the Qur'an, we expect that this book too will revolve around a definite subject, that the subject matter of the book too will be clearly defined at the beginning and will then be neatly divided into sections and chapters, after which discussion will proceed in a logical sequence. We likewise expect a separate and systematic arrangement of instruction and guidance for each of the various aspects of human life.\n\n           However, as soon as we open the Qur'an, we encounter a hitherto completely unfamiliar genre of literature. We notice that it embodies precepts of belief and conduct, moral directives, legal prescriptions, exhortations and admonition, censure and condemnation of evildoers, warning to the deniers of the Truth, good tidings and words of consolation and good cheer to those who have suffered for the sake of Allah, arguments and corroborative evidence in support of its basic message, allusions to anecdotes from the past and the signs of Allah visible in the universe. Moreover, these myriads subjects alternate without any apparent system; quite unlike the books to which we are accustomed, the Qur'an deals with the same subject over and over again, each time couched in a different phraseology.\n\n           The reader also encounters abrupt transitions between one subject matter and another. Audience and speaker constantly change as the message is directed now to one and now to another group of people. There is no trace of the familiar divisions into chapters and sections. Likewise, the treatment of of different subjects is unique. If an historical subject is raised, the narrative does not follow the pattern familiar in historical accounts. In the discussion of philosophical or metaphysical questions, we miss the familiar expressions and terminology of formal logic and philosophy. Cultural and political matters, or questions pertaining to man's social and economic life, are discussed in a way very different from that usual in work of social sciences. Juristic principles and legal injunctions are elucidated, but quite differently from the manner of conventional works. When we come across an ethical instruction, we find its form entirely differs from anything to be found elsewhere in the literature of ethics. The reader may find all this so foreign to his notion of what a book should be that he may become so confused as to feel that the Qur'an is a piece of disorganised, incoherent and\n           1/17\n           unsystematic writing, comprising nothing but a disjointed conglomeration of comments of varying lengths put together arbitrarily. Hostile critics use this as a basis for their criticism, while those more favourably inclined resort to far-fetched explanations, or else conclude that the Qur'an consists of unrelated pieces, thus making it amenable to all kinds of interpretations, even interpretations quite opposed to the intent of Allah Who revealed the Book.\n          "
    },
    {
      "Sno": "Section II of XI",
      "Content": "What kind of book, is the Qur'an? In what manner was it revealed? what underlies its arrangement? What is its subject? What is its true purpose? What is the central theme to which its multifarious topics are intrinsically related? What kind of reasoning and style does it adopt in elucidating its central theme? If we could obtain clear, lucid answers to these and other related questions, we might avoid some dangerous pitfalls, thus making it easier to reflect upon and to grasp the meaning and purpose of the Qur'anic verses. If we begin studding the Qur'an in the expectation of reading a book on religion, we shall find it hard, since our notions of religion and of a book are naturally circumscribed by our range of experience. We need, therefore, to be told in advance that this Book is unique in the manner of its composition, in its theme and its contents and arrangement. We should be forewarned that the concept of a book that we have formed from our previous readings is likely to be a hindrance, rather than a help, towards a deep understanding of the Qur'an. We should realise that as a first step towards understanding it we must disabuse our minds of all preconceived notions."
    },
    {
      "Sno": "Section III of XI",
      "Content": "The student of the Qur'an should grasp, from the outset, the fundamental claims that the Qur'an makes for itself. Whether one ultimately decides to believe in the Qur'an or not, one must recognise the fundamental statements made by the Qur'an and by the man to whom it was revealed, the Prophet Muhammad ( peace be upon him) to be the starting point of one's study. These claims are:\n\n           1. The Lord of creation, the Creator and Sovereign of the entire universe, created man on earth (which is merely a part of His boundless realm). He also endowed man with understanding, with the ability to distinguish between the good and evil, with the freedom of choice and volition, and with the power to exercise his latent potentialities. In short, Allah bestowed upon man a kind of autonomy and appointed him His vicegerent on earth.\n\n           2. Although man enjoys this status, Allah made it abundantly plain to him that He alone is man's Lord and Sovereign, even as He is the Lord and Sovereign of the whole universe. Man was told that he was not entitled to consider himself independent and that only Allah entitled to claim absolute obedience, service and worship. It was also made clear to man that life in this world, for which he has been placed and invested with a certain honour and authority, was in fact a temporary term, and was meant to test him; that after the end of this earthly life man must return to Allah, Who will judge him on the basis of his performance, declaring who has succeeded and who has failed.\n\n           The right way for man is to regard Allah as his only Sovereign and the only object of his worship and adoration, to follow the guidance revealed by Allah, to act in this world in the consciousness that earthly life is merely a period of trial, and to keep his eyes fixed on the ultimate objective - success in Allah's final judgement. Every other way is wrong.\n           2/17\n\n           It was also explained to man that if he choose to adopt the right way of life - and in this choice he was free - he would enjoy peace and contentment in this world and be assigned, on his return to Allah, the Abode of eternal bliss and happiness known as Paradise. Should man follow any other way - although he was free to do so - he would experience the evil effects of corruption and disorder in the life of this world and be consigned to external grief and torment when he crossed the borders of the present world and arrived in Hereafter.\n\n           3. Having explained all this, the Lord of the Universe placed man on earth and communicated to Adam and Eve, the first human beings to live on earth, the guidance which they and their offspring were required to follow. These first human beings were not born in a state of ignorance and darkness. On the contrary, they began their life in the broad daylight of divine Guidance. They had intimate knowledge of reality and the Law which they were to follow was communicated to them. Their way of life consisted of obedience to Allah (i.e. Islam) and they taught their children to live in obedience to Him (i.e. to live as Muslims).\n\n           In the course of time, however, men gradually deviated from this true way of life and began to follow various erroneous ways. They allowed true guidance to be lost through heedlessness and negligence and sometimes, even deliberately, distorted it out of evil perversity. They associated Allah with a number of beings, human and non-human, real as well as imaginary, and adored them as deities. They adulterer the Allah-given knowledge of reality (al-'ilm in the Qur'anic terminology) with all kinds of fanciful ideas, superstitions and philosophical concepts, thereby giving birth to innumerable religions. They disregarded or distorted the sound and equitable principles of individual morality and of collective conduct (Shari'ah in Qur'anic terminology) and made their own laws in accordance with their base desires and prejudices. As a result, the world became filled with wrong and injustice.\n\n           4. It was inconsistent with the limited autonomy conferred upon man by Allah that he should exercise His overwhelming power and compel man to righteousness. It was also inconsistent with the fact that Allah had granted a term to the human species in which to show their worth that He should afflict men with catastrophic destruction as soon as they showed signs of rebellion. Moreover, Allah had undertaken from the beginning of creation that true guidance would be made available to man throughout the term granted to him and that this guidance would be available in a manner consist ant with man's autonomy. To fulfil this self assumed responsibility Allah chose to appoint those human beings whose faith in Him was outstanding and who followed the way pleasing to Him. Allah chose these people to be His envoys. He had His messages communicated to them, honoured them with an intimate knowledge of reality, provided them with the true laws of life and entrusted them with the task of recalling man to the original path from which he had strayed [These men were the Prophets and Messengers of Allah - Ed].\n\n           5. These Prophets were sent to different people in different lands and over a period of time covering thousands and thousands of years. They all had the same religion; the one originally revealed to man as the right way for him. All of them followed the same guidance; those principles of morality and collective life prescribed for man at the very outset of his existence. All these Prophets had the same mission - to call man to his true religion and subsequently to organise all those who accepted this message into a community (ummah) which would be bound by the Law Of Allah., which would strive\n           3/17\n           to establish its observance and would seek to prevent its violation. All the Prophets discharged their mission creditably in their own time. However, there were always many who refused to accept their guidance and consequently those who did accept it and became a 'Muslim community' [That is, a group of people committed to the true guidance of Allah as revealed to His Prophets. Here the word Muslim is not used in the sense of the followers of the last Messenger of Allah, Muhammad (peace be upon him), but in the wider sense, meaning all those who, at various periods, both before and after the advent of the Last Prophet, committed themselves to live in submission to Allah -Ed] gradually degenerated, causing the Divine Guidance to be lost, distorted or adulterated.\n\n           6. At last the Lord of the Universe sent Muhammad (peace be upon him) to Arabia and entrusted him with the same mission that He had entrusted to the earlier Prophets. This Last Messenger of Allah addressed the followers of the earlier Prophets (who had by this time deviated from their original teachings) as well as the rest of humanity. The mission of each Prophet was to call men to the right way of life, to communicate Allah's true guidance afresh and to organise into one community all who responded to his mission and accepted the guidance vouchsafed to him. Such a community was to be dedicated to the two-fold task of moulding its own life in accordance with the Allah's guidance and striving for the reform of the world. The Qur'an is the Book which embodies this mission and guidance, as revealed by Allah to Muhammad (peace be upon him).\n       "
    },
    {
      "Sno": "Section IV of XI",
      "Content": " If we remember these basic facts about the Qur'an it becomes easy to grasp its true subject, its central theme and the objective it seeks to achieve. Insofar as it seeks to explain the ultimate causes of man's success or failure the subject of the Book is MAN.\n\n           Its central theme is that concepts relating to Allah, the universe and man which have emanated from man's own limited knowledge run counter to reality. The same applies to concepts which have been either woven by man's intellectual fancies or which have evolved through man's obsession with animal desires. The ways of life which rest on these false foundations are both contrary to reality and ruinous for man. The essence of true knowledge is that which Allah revealed to man when He appointed him as His Vicegerent. Hence, the way of life which is in accordance with reality and conductive to human good is that which we have characterised above as 'the right way'. The real object of the Book is to call people to this 'right way' and to illuminate Allah's true guidance, which has often been lost either through man's negligence and heedlessness or distorted by his wicked perversity.\n\n           If we study the Qur'an with these facts in mind it is bound to strike us that the Qur'an does not deviate one iota from its main subject, its central theme and its basic objective. All the various themes occurring in the Qur'an are related to the central theme; just as beads of different colour may be strung together to form a necklace. The Qur'an speaks of the structure of the heavens and the earth and of man, refers to the signs of reality in the various phenomena of the universe, relates anecdotes of bygone nations, criticizes the beliefs, morals and deeds of different people, elucidates supernatural truths and discusses many other things besides. All this the Qur'an does, not in order to provide instruction in physics, history, philosophy or any other particular branch of knowledge, but rather to remove the misconceptions people have about reality and to make that reality manifest\n           4/17\n           them.\n\n           It emphasizes that the various ways men follow, which are not in conformity with reality, are essentially false, and full of harmful consequences for mankind. It calls on men to shun all such ways and to follow instead the way which both conforms to reality and yields best practical results. This is why the Qur'an mentions everything only to the extent and in the manner necessary for the purposes it seeks to serve. The Qur'an confines itself to essentials thereby omitting any irrelevant details. Thus, all its contents consistently revolve around this call.\n\n           Likewise, it is not possible fully to appreciate either the style of Qur'an, the order underlying the arrangement of its verses or the diversity of the subjects treated in it, without fully understanding the manner in which it was revealed.\n\n           The Qur'an, as we have noted earlier, is not a book in the conventional sense of the term. Allah did not compose and entrust it in one piece to Muhammad (peace be upon him) so that he could spread its message and call people to adopt an attitude to life consonant with its teachings. Nor is the Qur'an one of those books which discusses their subjects and main themes in the conventional manner. Its arrangement differs from that of ordinary books, and its style is correspondingly different. The nature of this Book is that Allah chose a man in Makkah to serve as His Messenger and asked him to preach His message, starting in its own city (Makkah) and with his own tribe (Quraysh). At this initial stage, instructions were confined to what was necessary at this particular juncture of the mission. Three themes in particular stand out:\n\n           Directives were given to the Prophet (peace be upon him) on how he should prepare for his great mission and how he should begin working for the fulfilment of his task. A fundamental knowledge of reality was furnished and misconceptions commonly held by people in tat regard - misconceptions which gave rise to wrong orientation in life - were removed. People were exhorted to adopt the right attitude towards life. Moreover, the Qur'an also elucidated those fundamental principles which, if followed, lead to man's success and happiness.\n\n           In keeping with the character of the mission at this stage the early revelations generally consisted of short verses, couched in language of uncommon grace and power, and clothed in a literary style suited to the taste and the temperament of the people to whom they were originally addressed, and whose hearts they were meant to penetrate. The rhythm, melody and vitality of these verses drew rapt attention, as such was their stylistic grace and charm that people began to recite them involuntarily.\n\n           The local colour of these early messages in conspicuous, for while the truth s they contained were universal, the arguments and illustrations used to elucidate them were drawn from the immediate environment familiar to the first listeners. Allusions were made to their history and traditions and to the visible traces of the past which had crept into the beliefs, and into the moral and social life of Arabia. All this was calculated to enhance the appeal the message held for its immediate audience. This early stage lasted for four or five years, during which period the following reactions to the Prophet's message manifested themselves:\n           5/17\n\n           1. A few people responded to the call and agreed to join the ummah (comminity) committed, of its own volition, to submit to the Will of Allah.\n\n           2. Many people reacted with hostility, either from ignorance or egotism, or because of chauvinistic attachment to the way of life of their forefathers.\n\n           3. The call of the Prophet, however, did not remain confined to Makkah or the Quraysh. It began to meet with favourable response beyond the borders of that city and among other tribes.\n\n           The next stage of the mission was marked by hard, vigorous struggle between the Islamic movement and the age old Ignorance [ Jahiliyah - The author uses the term Jahiliyah to denote all those world-views and ways of life which are based on the rejection or disregard of the heavenly guidance which is communicated to mankind through the Prophets and Messengers of Allah; the attitude of treating human life - either wholly or partially - as independent of the directives revealed by Allah. For this see the writings of the author, especially 'Islam and Ignorance', Lahore, 1976), and 'A short History of Revivalist Movements in Islam', tr. al-Ashari , III edition, Lahore, 1976 -Ed] of Arabia. Not only were the makkans and the Quraysh bent upon preserving their inherited way of life, they were also firmly resolved to suppress the new movement by force. They stopped at nothing in the pursuit of this objective. They resorted to false propaganda; they spread doubt and suspicion and used subtle, malicious insinuations to sow distrust in people's minds. They tried to prevent people from listening to the message of the Prophet. They perpetrated savage cruelties on those who embraced Islam. They subjected them to economic and social boycott, and persecuted them to such an extent that on two occasions a number of them were forced to leave home and emigrate to Abyssinia, and finally they had to emigrate en masse to Madina.\n\n           In spite of this strong and growing resistance and opposition, the Islamic movement continued to spread. There was hardly a family left in Makkah one of whose members at least had not embraced Islam. Indeed, the violence and bitterness of the enemies of Islam was due to the fact that their own kith and kin - brothers, nephews, sons, daughters, sisters, brother-in-law and so on - had not only embraced Islam, but were even ready to sacrifice their lives for its sake. Their resistance, therefore, brought them into conflict with their own nearest and dearest. Moreover, those who had forsaken the age old Ignorance of Arabia included many who were outstanding members of their Society. After embracing Islam, they became so remarkable for their moral uprightness, their veracity and their purity of character that the world could hardly fail to notice the superiority of the message which was attracting people of such qualities.\n\n           During the Prophet's long and arduous struggle Allah continued to inspire him with revelations possesing at once the smooth, natural flow of a river, the violent force of a flood and the overpowering effect of a fierce fire. These messages instructed the beleivers in their basic duties, inculcated in them a sense of communicate and belonging, exhorted them to piety, moral excellence and puritgy of character, taught them how to preach the true faith, sustained their spirit by promises of success and Paradise in the Hereafter, arouse them to struggle in the cause of Allah with patience, fortitude and high spirits, and filled their hearts with such zeal and enthusiasm that they were prepared to endure every sacrifice, brave every hardship and face every adversity.\n           6/17\n\n           At the same time, those either bent on opposition, or who had deviated from the right way, or who had immersed themselves in frivolity and wickedness, were warned by having their attentions called to the tragic ends of nations with whose fates they were familiar. They were asked to draw lessons from the ruins of those localities through which they passed every day in the course of their wanderings. Evidence for the unity of Allah and for the existence of After-life was pointed to in signs visible to their own eyes and within the range of their ordinary experience. The weaknesses inherent in polytheism, the vanity of man's ambition to become independent even of Allah, the folly of denying the After-life, the perversity of blind adherence to the ways of one's ancestors regardless of right or wrong, were all fully elucidated with the help of arguments cogent enough to penetrate the minds and hearts of audience.\n\n           Moreover, every misgiving was removed, a reasonable answer was provided to every objection, all confusion and perplexity was cleared up, and Ignorance was besieged from all sides till its irrationality was totally exposed. Along with all this went the warning of the wrath of Allah. The people were reminded of the horrors of the Doomsday and the tormenting punishment of the Hell. They were also censured for their moral corruption, for their erroneous ways of life, for their clinging to the ways of Ignorance, for their opposition to Truth and their persecution of the believers. Furthermore, these messages enunciated those fundamental principles of morality and collective life on which all sound and healthy civilizations enjoying Allah's approval had always rested.\n\n           This stage was unfolded in several phases. In each phase, the preaching of the message assumed ever wider proportions, as the struggle fort he cause of Islam and opposition to it became increasingly intense and severe, and as the believers encountered people of varying outlooks and beliefs. All these factors had the effect of increasing the variety of the topics in the messages revealed during this period. Such, in brief, was the situation forming the background to the Makkan surahs of the Qur'an.\n          "
    },
    {
      "Sno": "Section V of XI",
      "Content": "For thirteen years the Islamic movement strive in Makkah. It then obtained, in Madina, a haven of refuge in which to concentrate its followers and its strength. The Prophet's movement now centred in its third stage.\n\n           During this stage, circumstances changed drastically. The Muslim Community succeeded in establishing a fully-fledged state; its creation was followed by prolonged armed conflict with the representatives of the ancient Ignorance of Arabia. The community also encountered followers of the former Prophets, i.e. Jews and Christians. An additional problem was that hypocrites began to join the fold of Muslim community; their machinations needed to be resisted. After a severe struggle, lasting ten years, the Islamic movement reached a high point of achievement when the entire Arabian peninsula came under its sway and the door was open to the world-wide preaching and reform. This stage, like the preceding one, passed through various phases each of which had its peculiar problems and demands.\n\n           It was in the context of these problems that Allah continued to reveal messages to the Prophet. At times these messages were couched in the form of fiery speeches; at other times they were\n           7/17\n           characterised by the grandeur and stateliness of majestic proclamations and ordinances. At times they had the air of instructions from a teacher; at others, the style of preaching of reformer. These messages explained how a healthy society, state and civilization could be established and the principles on which the various aspects of human life should be based.\n\n           They also dealt with matters directly related to the specific problems facing Muslims. For example, how should they deal with hypocrites (who were harming the Muslims the Muslim community from within) and with the non-Muslims who were living under the care of the Muslim society? How should they relate to the people of the Book? What treatment should be meted out to those with whom the Muslims were at war, and how should they deal with those with whom they were bound by treaties and agreements? How should the believers, as a community, prepare to discharge their obligations as vicegerents of the Lord of Universe? Through the Qur'an the Muslims were guided in questions like these, were instructed and trained, made aware of their weaknesses, urged to risk their lives and property for the cause of Allah, taught the code of morality they should observe in all circumstances of life - in times of victory and defeat, ease and distress, prosperity and adversity, peace and security, peril and danger.\n\n           In short, they were being trained to serve as the successors of the mission of the Prophet, with the task of carrying on the message of Islam and bringing about the reform in human life. The Qur'an also addressed itself to those outside the fold of Islam, to the People of the Book, the hypocrites, the unbelievers, the polytheists. Each group was addressed according to its own particular circumstances and attitudes. Sometimes the Qur'an invited them to the true faith with tenderness and delicacy; on other occasions, it rebuked and severely admonished them. It also warned them against, and threatened them with punishment from Allah. It attempted to make them take heed by drawing their attention to instructive historical events. In short, people were left with no valid reason for refusing the call of the Prophet.\n\n           Such, briefly, is the background of the Medinan Surahs of the Qur'an.\n\n           It is now clear to us that the revelation of the Qur'an began and went hand in hand with the preaching of the message. This message passed through many stages and met with diverse situations from the very beginning and throughout a period of twenty-three years. The different parts of the Qur'an were revealed step by step according to the multifarious, changing needs and requirements of the Islamic movement during these stages. It therefore, could not possibly possess the kind of coherence and systematic sequence expected of doctoral dissertation. Moreover, the various fragments of the Qur'an which were revealed in harmony with the growth of Islamic movement were not published in the form of written treatises, but were spread orally. Their style, therefore, bore an oratorical flavour rather than the characteristics of literary composition.\n\n           Furthermore, these orations were delivered by one whose task meant he had to appeal simultaneously to the mind, to the heart and emotions, to the people of different mental levels and dispositions. He had to revolutionize people's thinking, to arouse in them a storm of noble emotions in support of his cause, to persuade his Companions and inspire them with devotion and zeal, and with the desire to improve and reform their lives. He had to raise their morale and steel their determination, turn enemies into friends and opponents into admirers, disarm those out to oppose\n           8/17\n           his message and show their position to be morally untenable. In short, he had to do everything necessary to carry out his movement through to a successful conclusion. Orations revealed in conformity with the requirement of a message and movement will inevitably have a style different from that of a professional lecture.\n\n           This explains the repetitions we encounter in the Qur'an. The interests of a message and a movement demand that during a particular stage emphasis should be placed only on those subjects which are appropriate at that stage, to the exclusion of matters pertaining to later stages. As a result, certain subjects may require continual emphasis for months or even years. On the other hand, content repetition in the same manner becomes exhausting. Whenever a subject is repeated, it should therefore be expressed in different phraseology, in new forms and with stylistic variations so as to ensure that the ideas and beliefs being put over find their way into the hearts of the people.\n\n           At the same time, it was essential that the fundamental beliefs and principles on which the whole movement was based should always be kept fresh in people's minds; a necessity which dictated that they should always be repeated continuously through all stages of the movement. For this reason, certain basic Islamic concepts about the unity of Allah and His Attributes, about the Hereafter, about man's accountability and about reward and punishment, about prophethood and belief in revealed scriptures, about basic moral attributes such as piety, patience, trust in Allah and so on, recur throughout the Qur'an. If these ideas had lost their hold on the minds of the people, the Islamic movement could not have moved forward in its true spirit.\n\n           If we reflect on this, it also becomes evident why the Prophet (peace be upon him) did not arrange the Qur'an in the sequence that it was revealed. As we noted, the context in which the Qur'an was revealed in the course of twenty-three years was the mission and the movement of the Prophet; the revelations correspond to the various stages of this mission and movement. Now, it is evident that when the Prophet's mission was completed, the chronological sequence of the various parts of the Qur'an - revealed in accordance with the growth of the Prophet's mission - could in no way be suitable to the changed situation. What was now required was a different sequence in tune with the changed context resulting from the completion of the mission.\n\n           Initially, the Prophet's message was addressed to people totally ignorant of Islam. Their instruction had to start with the most elementary things. After the mission had reached to a successful completion, the Qur'an acquired a compelling relevance for those who had decided to believe in the Prophet. By virtue of that belief they had become a new religious community - the Muslim ummah. Not only that, they had been made responsible for carrying on the Prophet's mission, which he had bequeathed to them, in a perfect form, both on conceptual and practical levels. It was no longer necessary for Qur'anic verses to be arranged in chronological sequence. In the changed context, it had become necessary for the bearers of the mission of the Prophet ( peace be upon him) to be informed of their duties and of the true principles and laws governing their lives. They also had to be warned against corruptions which had appeared among the followers of earlier Prophets. All this was necessary in order to equip the Muslims to go out and offer the light of Divine Guidance to the world steeped in darkness.\n\n           It would be foreign to the very nature of Qur'an to group together in one place all verses relating to\n           9/17\n           specific subject; the nature of the Qur'an requires that the reader should find teachings revealed during the Medinan period interspersed with those of the Makkan period, and vice versa. It requires the juxtaposition of early discourses with instructions from the later period of the life of the Prophet. This blending of the teachings from different periods helps to provide an overall view and an integrated perspective of Islam, and acts as a safeguard against lopsidedness. Furthermore, a chronological arrangement of the Qur'an would have been meaningful to the later generations only if it had been supplemented with explanatory notes and these had to be treated as inseparable appendices to the Qur'an. This would have been quite contrary to Allah's purpose in revealing the Qur'an; the main purpose of its revelation was that all human beings - children and young people, old men and women, town and country dwellers, laymen and scholars - should be able to refer to the Divine Guidance available to them in composite form and providentially secured against adulteration. This was necessary to enable people of every level of intelligence and understanding to know what Allah required of them. This purpose would have been defeated had the reader been obliged solemnly to recite detailed historical notes and explanatory comments along with the Book of Allah.\n\n           Those who object to the present arrangement of the Qur'an appear to be suffering from a misapprehension as to its true purpose. They sometimes almost seem under the illusion that it was revealed merely for the benefit of students of history and sociology!\n          "
    },
    {
      "Sno": "Section VI of XI",
      "Content": "The present arrangement of the Qur'an is not the work of later generations, but was made by the Prophet under Allah's directions. Whenever a surah was revealed, the Prophet summoned his scribes, to whom he carefully dictated its contents, and instructed them where to place it in relation to the other Suras. The Prophet followed the same order of suras and verses when reciting during ritual Prayer as on other occasions, and his Companions followed the same practice in memorizing the Qur'an. It is therefore a historical fact that the collection of the Qur'an of the Qur'an came to an end on the very day that its revelation ceased. The One who was responsible for its revelation was also the One who fixed its arrangement. The one whose heart was the receptacle of the Qur'an was also responsible for arranging its sequence. This was far too important and too delicate a matter for anyone else to become involved in.\n\n           Since Prayers were obligatory for the Muslims from the very outset of the Prophet's mission,( It should be noted that while five daily Prayers were made obligatory several years after the Prophet was commissioned, Prayers were obligatory from the very outset; not a single moment elapsed when Prayers, as such, were not obligatory in Islam) and the recitation of the Qur'an was an obligatory part of the Prayers, Muslims were committing the Qur'an to memory while its revelation was continued. Thus, as soon as a fragment of the Qur'an was revealed, it was memorized by some of the Companions. Hence the preservation of the Qur'an was not solely dependent on its verses being inscribed on palm leaves, pieces of bone, leather and scraps of parchment - the material used by the Prophet's scribes for writing down Qur'anic verses. Instead those verses came to be inscribed upon scores, then hundreds, then thousands, then hundreds of thousands of human hearts, soon after they had been revealed, so that no scope was left for any devil to alter so much as one word of them.\n           10/17\n\n           When, after the death of Prophet, the storm of apostasy convulsed Arabia and the Companions had to plunge into bloody battles to suppress it, many Companions who had memorized the Qur'an suffered martyrdom. This led 'Umar to plead that the Qur'an ought to be preserved in writing, as well as orally. He therefore impressed the urgency upon Abu Bakr. After slight hesitation, the later agreed and entrusted the task to Zayd ibn Thabit al-ansari, who had worked as a scribe of the Prophet. [For an account of the early history of the Qur'an see Subhi- al salih, Mabahith fi 'Ulum al-Qur'an, Beriut, 1977, pp. 65 ff -Ed]\n\n           The procedure decided upon was to try and collect all written pieces of the Qur'an left behind by the Prophet, as well as those in the possession of the Companions. (There are authentic traditions to the effect that several Companions had committed the entire Qur'an, or many parts of it, to writing during the lifetime of the Prophet. Especially mentioned in theis connection are the following Companions of the Prophet: 'Uthman, 'Ali, 'Abd Allah b. Mas'ud, 'Abd Allah b. 'Amr al 'As, Salim the mawla of Hudhayfah, Mu'audh b. Jabal,Ubbay b. Ka'b, and Abu Zayd Qays b. al-Sakan). When all this had been done, assistance was sought from those who had memorized the Qur'an. No verse was incorporated into the Qur'anic codex unless all three sources were found to be complete agreement, and every criterion of verification had been satisfied. Thus an authentic version of the Qur'an was prepared. It was kept in the custody of Hafsah (a wife of the Holy Prophet) and people were permitted to make copies of it and also to use it as the standard of comparison when rectifying the mistakes they might have made in writing down the Qur'an.\n\n           In different parts of Arabia and among its numerous tribes their existed a diversity of dialects. The Qur'an was revealed in the language spoken by the Quraysh of Makkah. Nevertheless, in the beginning, people of other areas and other tribes were permitted to recite it according to their own dialects and idioms, since it facilitated its recitation without affecting its substantive meaning. In course of time, in the wake of the conquest of a sizeable part of the world outside of the Arabian peninsula, a large number of non-Arabs entered the fold of Islam. These developments affected the Arabic idiom and it was feared that the continuing use of various dialects in the recitation of the Qur'an might give rise to grave problems. It was possible, for instance, that someone hearing the Qur'an in unfamiliar dialect might pick a fight with the reciter, thinking that the later was deliberately distorting the Word of Allah. It was also possible that such differences might gradually lead to the tampering of the Qur'an itself. It was also not inconceivable that the hybridization of the Arabic language, due to the intermixture between the Arabs and non-Arabs, might lead people to introduce modifications into the Qur'anic text, thus impairing the grace of the Speech of Allah. As a result of such considerations, and after consultations with the Companions of the Prophet, 'Uthman decided that copies of the standard edition of the Qur'an, prepared earlier on the order of Abu Bakr, should be published, and that publication of the Qur'anic text in any other dialect or idiom should be proscribed.\n\n           The Qur'an that we possess today corresponds exactly to the edition which was prepared on the orders of Abu Bakr and copies of which were officialy sent, on the orders of 'Uthman, to various cities and provinces. Several copies of this original edition of Qur'an still exist today. Anyone who entertains any doubt as to the authenticity of the Qur'an can satisfy himself by obtaining a copy of the Qur'an from any bookseller, say in West Africa, and then have a hafiz ( memorizer of the Quran) recite it from memory, compare the two, and then compare these with the copies of the Qur'an\n           11/17\n           published through the centuries since the time of 'Uthman. If he detects any discrepancy, even in single letter or syllable, he should inform the whole world of his great discovery!\n\n           Not even the most sceptical person has a reason to doubt the Qur'an as we know today is identical with the Qur'an which Muhammad (peace be upon him) set before the world; this is an unquestionable, objective, historical fact, and there is nothing in human history on which the evidence is so overwhelmingly strong and conclusive. To doubt the authencity of the Qur'an is like doubting the existence of Roman empire, the Mughals of India, or Napoleon! To doubt historical facts like these is a sign of stark ignorance, not a mark of erudition and scholarship.\n          "
    },
    {
      "Sno": "Section VII of XI",
      "Content": "The Qur'an is a book to which innumerable people turn for innumerable purposes. It is difficult to offer advice appropriate to all. The readers to whom this work is addressed are those who are concerned to acquire a serious understanding of the Book, and who seek the guidance it has to offer in relation to the various problems of life. For such people we have a few suggestions to make, and we shall offer some explanations in the hope of facilitating their study of Qur'an.\n\n           Anyone who really wants to understand the Qur'an irrespective of whether or not he believes in it, must divest his mind, as far as possible, of every preconceived notion, bias or prejudice, in order to embark upon his study with an open mind. Anyone who begins to study the Qur'an with a set of preconceived ideas is likely to read those very ideas into the Book. No Book can be profitably studied with this kind of attitude, let alone the Qur'an which refuses to open its treasure-house to such readers.\n\n           For those who want only a superficial acquaintance with the doctrines of the Qur'an one reading is perhaps sufficient. For those who want to fathom its depths several readings are not enough. These people need to study the Qur'an over and over again, taking notes of everything that strikes them as significant. Those who are willing to study the Qur'an in this manner should do so at least twice to begin with, so as to obtain a broad grasp of the system of beliefs and practical prescriptions that it offers. In this preliminary survey, they should try to gain an overall perspective of the Qur'an and to grasp the basic ideas which it expounds, and the system of life it seeks to build on the basis of these ideas. If, during the course of this study, anything agitates the mind of the reader, he should note down the point concerned and patiently persevere with his study. He is likely to find that, as he proceeds, the difficulties are resolved. (When a problem has been solved, it is advisable to note down the solution alongside the problem.) Experience suggests that any problem still unsolved after a first reading of the Qur'an are likely to be resolved by a careful second reading.\n\n           Only after acquiring a total perspective of the Qur'an should a more detailed study be attempted. Again the reader is well advised to keep noting down the various aspects of the Qur'an's teachings. For instance, he should note the human model the Qur'an extols as praiseworthy, and the model it denounces. It might be helpful to make two columns, one headed 'praiseworthy qualities', the other headed 'blameworthy qualities', and then to enter into the respective columns all that is found relevant in the Qur'an. To take another instance, the reader might proceed to investigate the Qur'anic point of view on what is conductive to human success and felicity, as against what leads to man's ultimate failure and perdition. An efficient way to carry out this investigation would be to note under separate headings, such as 'conductive to success' and 'conductive\n           12/17\n           to failure', any relevant material encountered. In the same way, the reader should take down the notes about the Qur'anic teachings on the questions of beliefs, morals, man's rights and obligations, family life and collective behaviour, economic and political life, law and social organization, war and peace, and so on. Then he should use these various teachings to try to develop an image of the Qur'anic teachings vis-a-vis each particular aspect of human life. This should be followed by an attempt at integrating these images so that he comes to grasp the total scheme of life envisaged by the Qur'an.\n\n           Moreover, anyone wishing to study in depth the Qur'anic view-point on any particular problem of life should, first of all, study all the significant strands of human thought concerning the problem. Ancient and modern works on the subject should be studied. Unresolved problems where human thinking seems to have got stuck should be noted. The Qur'an should then be studied with these unresolved problems in mind, with a view to finding the solutions the Qur'an has to offer. Personal experience again suggests that anyone who studies the Qur'an in this manner will find his problems solved with the help of verses which he may have read scores of times without it ever crossing his mind that they could have any relevance to the problems at hand.\n\n           It should be remembered, nevertheless, that full appreciation of the spirit of the Qur'an demands practical involvement with the struggle to fulfil its mission. The Qur'an is neither a book of abstract theories and cold doctrines which the reader can grasp while seated in a cosy armchair, nor is it merely a religious book like other religious books, the secrets of which can be grasped in seminaries and oratories. On the contrary, it is the blueprint and guidebook of a message, of a mission, of a movement. As soon as this Book was revealed, it drove a quiet, kind-hearted man from his isolation and seclusion, and placed him in a battlefield of life to challenge a world that had gone astray. It inspired him to raise his voice against falsehood, and pitted him in a grim struggle against the standard-bearers of unbelief, of disobedience to Allah, of waywardness and error. One after the other, it sought out everyone who had a pure and noble soul, mustering them together under the standard of the Messenger. It also infuriated all those who by their nature were bent on all mischief and drove them to wage war against the bearers of Truth.\n\n           This is the Book which inspired and directed the great movement which began with the preaching of a message by an individual, and continued for no fewer than twenty-three years, until the Kingdom of Allah was truly established on earth. In this long and heart-rending struggle between the Truth and falsehood, this Book unfailingly guided its followers to the eradication of the latter and the consolidation and enthronement of the former. How then could one expect to get to the heart of Qur'anic verses, without so much as stepping upon the field of battle between filth and unbelief, between Islam and Ignorance? To appreciate the Qur'an fully one must take it up and launch into the task of calling people to Allah, making it one's guide at every stage.\n\n           Then, and only then, does one meet the various experiences encountered at the time of its revelation. One experiences the initial rejection of the message of Islam by the city of Makka, the persistent hostility leading to the quest for a haven of refuge in Abyssinia, and the attempt to win a favourable response from Ta'if which led, instead, to cruel persecution of the bearer of the Qur'anic message. One experiences also the campaigns of Badr, of Uhad, of Hunayn and of Tabuk. One comes\n           13/17\n           face to face with Abu Jahl and Abu Lahab, with hypocrites and Jews, with those who instantly respond to this call as well as those who, lacking clarity of perception and moral strength, were drawn into Islam only at a later stage.\n\n           This will be an experience different from any so-called 'mystic experience'. I designate it the 'Qur'anic mystic experience'. One of the characteristics of this 'experience' is that at each stage one almost automatically finds certain Qur'anic verses to guide one, since they were revealed at similar stage and therefore contain the guidance appropriate to it. A person engaged in this struggle may not grasp all the linguistic and grammatical subtleties, he may also miss certain finer points in the rhetoric and semantics of the Qur'an, yet it is impossible for the Qur'an to fail to reveal its true spirit to him.\n\n           Again, in keeping with the same principle, a man can neither understand the laws, the moral teachings, and the economic and political principles which the Qur'an embodies, nor appreciate the full import of the Qur'anic laws and regulations, unless he tries to implement them in his own life. Hence the individual who fails to translate the Qur'anic precepts into personal practice will fail to understand the Book. The same must be said of any nation that allows the institutions of its collective life to run contrary to the teachings of Qur'an.\n           "
    },
    {
      "Sno": "Section VIII of XI",
      "Content": "It is well known that the Qur'an claims to be capable of guiding all mankind. Yet the student of the Qur'an finds it generally addressed to the people of Arabia, who lived in the time of its revelation. Although the Qur'an occasionally addresses itself to all mankind its contents are, on the whole, vitally related to the taste and the temperament, the environment and history, and the customs and usages of Arabia. When one notices this, one begins to question why a Book which seeks to guide all mankind to salvation should assign such importance to certain aspects of a particular people's life, and to the things belonging to a particular age and clime. Failure to grasp the real cause of this may lead one to believe that the Book was originally designed to reform the Arabs of the particular age alone, and it is only the people of later times who have forced upon the Book an altogether novel interpretation, proclaiming that its aim is to guide all mankind for all time.\n\n           Some might say this with no other purpose then to went their irrational prejudice against Islam. but leaving such people aside, a word may be said to those whose critical comments are motivated by the desire to understand things better. The later would do well to study the Qur'an carefully, noting down any places where they find that it has propounded any doctrine or concept, or laid down some rule for practical conduct, relevant for the Arabs alone and exclusively conditioned by the peculiarities of a certain place or time. If, while addressing the people of certain area at a particular period of time, attempting to refute their polytheistic beliefs and adducing arguments in support of its own doctrine of the unity of Allah, the Qur'an draws upon facts with those people were familiar, this does not warrant the conclusion that its message is relevant only for that particular people or for that particular period of time.\n\n           What ought to be considered is whether or not the Qur'anic statements on refutation of the polytheistic beliefs of the Arabs of those days apply as well to other forms of polytheism in other\n           14/17\n           parts of world. Can the arguments advanced by the Qur'an in that connection be used to rectify the beliefs of other polytheists? Is the Qur'anic line of argument for establishing the unity of Allah, with minor adaptations, valid and persuasive for every age? If the answers are positive, there is no reason why a universal teaching should be dubbed exclusive to a particular people and merely because it happened to be addressed originally to that people and at that particular period of time. No philosophy, ideology or doctrine consists only of mere abstractions and is totally unrelated to the circumstances in which it developed. Even if such an absolute abstraction were possible it would remain confined to the scraps of paper on which it was written and would fail totally to have an impact on human life.\n\n           Moreover, if one wishes to spread any intellectual, moral and cultural movement on an international scale, it is by no means essential, in fact it is not even useful, for it to start on a global scale. If one wishes to propagate certain ideas, concepts and principles as the right bases for human life, one should begin by propagating them vigorously in the country where the message originates, and to the people whose language, temperament, customs and habits are familiar to its proponents. It will thus be possible to transform the lives of the people into a practical model of the message. Only then will it be able to attract the attention of other nations, and intelligent people living elsewhere will also try to understand it and to spread it in their own lands.\n\n           Indeed, what marks out a time-bound form an eternal and a particularistic national doctrine from an universal one, is the fact that the former either seek to exalt a people or to claim special privileges for it or else comprises ideas and principles so vitally related to the people's life and tradition as to tender it totally inapplicable to the conditions of other peoples. A universal doctrine, on the other hand, is willing to accord equal rights and status to all, and its principles have an international character in that they are equally applicable to other nations. Likewise, the validity of those doctrines which seek to come to grips merely with questions of a transient and superficial nature is time-bound. If one studies the Qur'an with these considerations in mind, can one really conclude that it has only a particularistic national character, and that its validity is therefore time-bound?\n           "
    },
    {
      "Sno": "Section IX of XI",
      "Content": "Those who embark upon a study of Qur'an often proceed with the assumption that this Book is, as it is commonly believed to be, a detailed code of guidance. However, when they actually read it, they fail to find detailed regulations regarding social, political and economic matters. In fact, they notice that the Qur'an has not laid down detailed regulations even in respect of such oft-repeated subjects as Prayers and Zakah (Purifying alms). The reader finds this somewhat disconcerting and wonders in what sense the Qur'an can be considered a code of guidance.\n\n           The uneasiness some people feel about this arises because they forget that Allah did not merely reveal a Book, but that He also designated a Prophet. Suppose some laymen were to be provided with the bare outlines of a construction plan on the understanding that they would carry out the construction as they wished. In such a case, it would be reasonable to expect that they should have very elaborate directives as to how the construction should be carried out. Suppose, however, that along with the broad outline of the plan of construction, they were also provided with a competent engineer to supervise the task. In that case, it would be quite unjustifiable to disregard the work of\n           15/17\n           the engineer, on the expectation that detailed directives would form an integral part of the construction plan, and then to complain of imperfection in the plan itself. [This analogy should elucidate the position of the Prophet vis-a-vis the Qur'an, for he clarified and elaborated the Qur'an, supplementing its broad general principles by giving them precise and detailed forms, and incorporating them into practical life, his own as well as that of his followers -Ed].\n\n           The Qur'an, to put it succinctly, is a Book of broad general principles rather than of legal minutiae. The Book's main aim is to expound, clearly and adequately, the intellectual and moral foundations of the Islamic programme for life. It seeks to consolidate these by appealing both to man's mind and to his heart. Its method of guidance for practical Islamic life does not consist of laying down minutely detailed laws and regulations. It prefers to outline the basic framework for each aspect of human activity, and to lay down certain guidelines within which man can order his life in keeping with the Will of Allah. The mission of the Prophet was to give practical shape to the Islamic vision of the good life, by offering the world a model of an individual character and of a human state and society, as living embodiments of the principles of the Qur'an.\n           "
    },
    {
      "Sno": "Section X of XI",
      "Content": "The Qur'an is strong in the condemnation of those who indulge in schismatic squabbling after the Book Of Allah has been revealed, so causing a weakening of faith; [See Qur'an 98:4,3:105, 42:14 -Ed] yet there has been considerable disagreement over the correct interpretation of the Qur'anic injunctions, not only among the later scholars, but even among the founders of the legal schools and Successors [The word Successors has been used as the equivalent of Tabiun, i.e. those who benefited from the Companions of the Prophet - Ed]. Indeed, disagreement can be traced back even to the times of the Companions of the Prophet [The word Companions has been used as an equivalent of Sahabah, i.e. those, who in state of belief, enjoyed the companionship of the Prophet( peace be upon him).-Ed]. One can hardly point to a single Qur'anic verse of legal import which has received complete unanimity as regards to its interpretation. One is bound to ask whether the Qur'anic condemnation applies to all who have disagreed in this way. If it does not, then what kind of schism and disagreement does the Qur'an denounce?\n\n           This is quite a problem and its ramifications cannot be considered at length here. The reader may rest assure that the Qur'an is not opposed to differences of opinion within the framework of a general agreement on the fundamentals of Islam and broad unity of Islamic community. In addition it is not opposed to disagreement arising from an earnest endeavour to arrive at the right conclusions on a particular subject; the only disagreements condemned by the Qur'an are those arising out of egotism and perversity, leading to mutual strife and hostility.\n\n           The two sorts of disagreements are different in character and give rise to different results. The first kind is a stimulus to improvement and the very soul of a healthy society. Differences of this kind are found in every society whose members are endowed with intelligence and reason. Their existence is a sign of life, while their absence serves only to demonstrate that a society is made up not of intelligent men and women but rather of blocks of wood. Disagreements of the second kind, however, are of altogether different character and lead to ruin and destruction of the people among whom they arise. Far from being a sign of health, their emergence is symptomatic of a grave\n           16/17\n           sickness.\n\n           The first kind of disagreement exists only among scholars who are all agreed that it is their duty to obey Allah and His Prophet. They also agree that the Qur'an and the Sunnah are their main sources of guidance. Thus, when scholarly investigation on some subsidiary question lead two or more scholars to disagree, or when two judges disagree in their judgement, nor the questions on which their opinion has been expressed, as fundamentals of faith. They do not accuse those who disagree with their opinion of having left the fold of true faith. What each does is rather to proffer his arguments showing that he has done his best to investigate the matter thoroughly. It is then left to the courts ( in judicial matters) and to public opinion ( if the matter relates to the community at large) either to prefer whichever opinions seems sounder, or to accept both opinions as equally permissible.\n\n           Schism occurs when the very fundamentals are made a matter of dispute and controversy. It may also happen that some scholar, mystic, mufti, or leader pronounces on a question to which Allah and His Messenger have not attached any fundamental importance, exaggerating the significance of the question to such extent that it is transformed into a basic issue of faith. Such people usually go one step further, declaring all those who disagree with their opinion to have forsaken the true faith and set themselves outside the community of true believers. They may go even so far as to organize those who agree with them into a sect, claiming that sect to be identical with the Islamic community, and declaring that everyone who does not belong to it is destined to hell-fire!\n\n           Whenever the Qur'an denounces schismatic disagreements and sectarianism, its aim is to denounce this later kind of disagreement. As for disagreements of the first category, we encounter several examples of these even during the life of the Prophet. The Prophet not only accepted the validity of such disagreements, he even expressed his approval of them. For this kind of disagreement shows that the community is not lacking in capacity for thought, for enquiry and investigation, for grasping or wrestling with the problems it faces. It also shows that the intelligent members of the community are earnestly concerned about their religion and how to apply its injunctions to practical problems of human life. It shows too that their intellectual capacities operate within the broad framework of their religion, rather than searching beyond its boundaries for solutions to their problems. And it proves that the community is following the golden path of moderation. Such moderation preserves its unity by broad agreement on fundamentals, and at the same time, provide its scholars and thinkers with full freedom of enquiry so that they may achieve fresh insights and new interpretations within the framework of the fundamental principles of Islam.\n           "
    },
    {
      "Sno": "Section XI of XI",
      "Content": "It is not intended here to survey all the questions that may arise in the mind of a student of Qur'an. Many questions relate to the specific suras or verses, and are explained in the notes to these in various commentaries. This introduction confines itself to basic questions related to the understanding of the Qur'an as a whole."
    }
  ]